---
type: AssetSet
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# AssetSet

`Autodesk.Revit.DB.Visual.AssetSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AssetSet | — | `public AssetSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Asset item )` |
| Method | Erase | — | `public virtual int Erase ( Asset item )` |
| Method | ForwardIterator | — | `public virtual AssetSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Asset item )` |
| Method | ReverseIterator | — | `public virtual AssetSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |